# BoundarySegment Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BoundarySegment Properties
BoundarySegment Class See Also
---
The BoundarySegment type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ElementId | Retrieve the id of the element that produces this boundary segment. If the segment is created from an element in a link, this is the id of the RevitLinkInstance. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| LinkElementId | Retrieve the element id of the element in a link instance that forms this boundary. |

# See Also
BoundarySegment Class
Autodesk.Revit.DB Namespace